
const quizData = {
  "מ\"כ": {
    popupText: "מפקד כיתה יקר, להלן בוחן הדרכה בנושא תו תקן לאיכות בהכשרה. הבוחן הינו אישי ומטרתו הינה להעריך את בקיאותך בנהלי תו התקן והבנתך בתהליכי הדרכה. הנך רשאית להשתמש בכל חומר עזר. אין הגבלת זמן על השאלות. הציון העובר במבחן הינו 80,  בשאלות רב ברירה ינתן ניקוד רק על תשובה נכונה מלאה. בהצלחה! גפה ביסלח.",

    questions: [
      {
        q: "מהו תו התקן?",
        answers: ["רשיון כשיר להכשיר", "מסמך המייצר אחידות בתהליכי הדרכה", "מסמך שמרכז את המענה הפיקודי", "מסמך המרכז את הנהלים למענה פיקודי בהכשרה"],
        correct: 1
      },
      {
        q: "מהו שעון ההדרכה והאם רלוונטי לדרגת המכ?",
        answers: ["רשימת מופעי הדרכה מדוריים בחלוקה לשבועות-רלוונטי לקצין קורס ורמד", "לוז ממג המכיל את מופעי המגמה-רלוונטי לרמת הרמד ומעלה", "רשימת עוגנים שבועיים בתקופת ההדרכה- רלוונטי לכל רמות הפיקוד", "לוז ענפי עם מופעי ההדרכה המשמש את הממג לבניית לוז מגמה- רלוונטי לרמת הממג"],
        correct: 2
      },
      {
        q: "איזה ידע נדרש לנהל בקמפוס הדיגיטלי? בחר את כל התשובות הנכונות",
        answers: ["מעקב הישגי החניכים ונוכחותם במופעים המהווים תנאי סף להכשרה", "משוב וחוודים על החניך", "ראיונות ושיחות אישיות", "תכנית החניכה והערכה", "לוז הכשרה ספיציפי"],
         correct: [0,1,2,3]
      },
      {
        q: "מה מהנושאים הבאים יצויין בסיכום ההכשרה לחניכים? בחר את כל התשובות הנכונות",
        answers: ["תכנון מול ביצוע תכנים", "טיפול בפרט", "חוזקות וחולשות בכשירות החניכים", "תכנית ההכשרה וההדרכה", "מנהלה ובטיחות"],
        correct: [1,3,4]
      },
      {
        q: "איזה סוגי מבחנים קיימים?",
        answers: ["מבחן מעשי", "מבחן עיוני", "מצב מבחן", "כל התשובות נכונת"],
        correct: 3
      },
      {
        q: "עד מתי ינתנו ציונים במבחנים עיוניים ומעשיים?",
        answers: ["מעשי עד שבוע ועיוני מיידית", "מעשי מיידית ועיוני עד שבוע", "מעשי עד שלושה ימים ועיוני עד שבוע", "מעשי מיידית ועיוני עד שבועיים"],
        correct: 1
      },
      {
        q: "לכל חניך ינתנו 2 מועדים למבחנים, במה מותנים מועדי ב' וג'?",
        answers: ["ב'- שיחת מפקד ישיר וג'-בשיחת מפ", "ב'-בשיחת מפקד ישיר וג'-בשיחת ממ", "ב'-בשיחת ממ וג'-בשיחת מפ", "ב'-בשיחת מפ וג'-בשיחת מגד"],
        correct: 0
      },
      {
        q: "מה יקרה לחניך שנכשל ב3 מבחנים?",
        answers: ["נעיף אותו מהקורס", "נתן לו להבחן פעם נוספת", "יעלה לשיחת מפ", "נפתח לו נוהל חניך מתקשה"],
        correct: 3
      },
      {
        q: "תיק מדריך נכתב לכל לבנה מקצועית בהכרשה?",
        answers: ["לא נכון", "נכון"],
        correct: 1
      },
       {
        q: "תיק המדריך מהווה הכנה מקצועית ועוזר באחידות מקצועית?",
        answers: ["לא נכון", "נכון"],
        correct: 1
      },
       {
        q: "יש לעבור על תיק המדריך לפני כל שיעור?",
        answers: ["לא נכון", "נכון"],
        correct: 1
      },
       {
        q: "תיק המדריך מכיל גם מעקבים על נוכחות החניכים?",
        answers: ["לא נכון", "נכון"],
        correct: 0
      },
       {
        q: "תיקוף תיק המדריך יהיה כשהשתנה התול / שיטת הלימוד",
        answers: ["לא נכון", "נכון"],
        correct: 1
      },
       {
        q: "מה מהבאים אינו חלק מהגדרות התפקיד של מכ בהכשרה?",
        answers: ["אחראי ליישום תכנית ההכשרה על פי פקודה שבועית", "אחראי על איתור וסיוע לחניכים מתקשים", "אחראי על אמצעי ההדרכה וציוד לחניכיו", "אחראי לביצוע מעקב על הישגי חניכיו"],
        correct: 2
      },
      {
        q: "איזה מבחנים על מפקד לבצע על מנת לפתוח מחזור הכשרה?",
        answers: ["מבחן רובאות עיוני הכולל שאלות בנושאים: קליעה, שדאות, כושר קרבי ורפואה", "מבחן רמה, בטיחות, רובאות עיוני, בוחן קליעה מעשי ובוחן תו תקן עיוני", "מבחן רמה עיוני ומעשי, בוחן כשג מעשי, בוחן קליעה מעשי,בוחן הדרכה ובוחן מענה הפיקודי", "מבחן מודיעיני עיוני, בוחן תו תקן עיוני,בוחן כשג מעשי"],
        correct: 2
      },
      {
        q: "מה נכון להגיד על איתור ומיון המפקדים? סמן את כל התשובות הנכונות",
        answers: ["סיום תהליך המיון יהיה לפחות שבוע לפני פתיחת המחזור", "היחיד שמעלה חניכים פוטנציאלים הוא המפ", "מפקדים בגדוד ישארו לפחות ל8 חודשים", "החניכים נבחרים על פי סוציומטרי חניכים"],
        correct: [0,3]
      },
      {
        q: "יניב הוא מכ שעתיד לפתוח מחזור שני בקורס מכים. הוא ידוע כמפקד טוב ואחראי. במהלך הכנת הסגל יניב נעדר ליומיים בשל אירוע משפחתי והפסיד סגירה מקצועית לשבוע פקלים וכן את בוחן הכשג והוחן המקצועי. כיצד יש לנהוג?", 
        answers: ["יניב לא יוכל לפתוח את המחזור-יש לפנות למגד על מנת לאתר מפקד מחליף", "יניב נדרש להשלים את בוח הכשג בלבד. משום שהוא עתיד לפתוח מחזור שני ולא חייב בוחן וסגירה מקצועית.", "יש להשלים ליניב את כלל המבחנים שלא ביצע ולוודא שמשלים את תוכן הסגירה המקצועית טרם פתיחת המחזור", "נדרש לבצע את הבחנים ליניב כתנאי לפתיחת המחזור השלמת הסגירה המקצועית הינה אחרויותו בזמנו הפנוי"],
        correct: 2
      },
      {
        q: "מהם מופעי החניכה המינימאליים שהנך מחוייב לעבור על ידי מפקדך הישיר?",
        answers: ["לפחות ארבעה, לפחות אחד על העברת שיעור", "לכל הפחות שני מופעים, אחד על חניכה על חניכה","לכל הפחות שני מופעים, אחד מהם על העברת תרגיל", "אף תשובה אינה נכונה"],
        correct: 1
      },
      {
        q: "מה מאפיין את תוכנית החניכה לאיש סגל? ",
        answers: ["מתעדכנת אחת למחזור", "רלוונטית לכל מריכבי הפיקוד- מקצועי, ערכי,פיקודי והדרכתי","לא חשופה לאיש הסגל-רק למפקדיו","נבנית בהתאם לחוזקות ולחולשות של איש הסגל","רלוונטית למכ בלבד"],
        correct: [0,1,3]
      },
       {
        q: "מי הסמכות להדיח מכ בהכשרה עקב פערים משמעותיים בביצוע התפקיד?",
        answers: ["מגד", "מפקד החטיבה","קצין חיל ראשי","במסגרת וועדה מיוחדת בראשות מפקד החטיבה"],
        correct: 1
      },
       {
        q: "מהו תהליך סיום התפקיד למכ במקרה של פער בביצוע התפקיד?",
        answers: ["דיווח לרממ->וועדת מגד->וועדת מחט", "דיווח לרממ->שיחת משוב ובניית תוכנית חניכה->וועד מגד->וועדת מחט->וועדת קחצר","שיחת משוב ובניית תוכנית חניכה->וועדת מגד->וועדת מחט","דיווח לרממ->שיחת משוב ובניית תוכנית חניכה->וועדת מגד->וועדת מחט"],
        correct: 3
      },
       {
        q: "חניכה על חניכה היא מופע בו מפקד חונך את המפקדים תחתיו על האופן בו הם מבצעים חניכה. אילו מבין הקריטריונים יש להעריך במסגרת זו? סמן את כל התשובות הנכונות",
        answers: ["אופן ביצוע התדריך של החונך לחניך טרם ביצוע המופע,מיקום החונך בזמן התצפית", "נקודת ההתערבות שמבצע החונך בזמן תצפית,אופן תיעוד התצפית","איתור התופעה הרלוונטית,שימוש בדף הערכה","אופן העברת המשוב והתמודדות עם התנגדויות החניך","כל התשובות נכונות"],
        correct: [4]
      },
       {
        q:"לכל חניך מתקשה נדרשת לבנות תוכנית לקידומו, מה התוכנית איננה כוללת?",
        answers: ["פירוט תחומי הקושי", "פירוט דרכי הפעולה לקידום החניך", "הגדרת יעדים עבור החניך לטווח הקצר","הגדרת השיבוץ החזוי לחניך"
        ],
        correct: 3
      },
       {
        q: "מהן דרכי הפעולה שעומדות בפני מפקד לסיוע לחניך מתקשה? סמן את כל התשובות הנכונות",
        answers: ["שעות תגבור פרטניות", "שימוש בחומר פתוח","התאמות במבחנים- הארכת זמן,הקראה וכו", "הצמדת חונך מקצועי - לדוגמא, משק עברית"],
        correct: [0,2,3]
      },
       {
        q: "מה מהבאים אינו קריטריון לבחירת חניך למופת?",
        answers: ["חווד מפקד בולט לחיוב", "סוציומטרי עמיתים גבוה", "ציוני מבחנים והתנסויות מעל 85", "ללא אירועי משמעת"],
        correct: 2
      },
      {
        q: "בחר מה הם הקריטריונים לסימון פוטנציאל מאותרים לפיקוד בהכשרה?",
        answers: ["יכולת העברת מסרים גבוהה, יכולת חניכה גבוהה", "יכולת הובלה ורתימה, יכולת למידה עצמית", "יכולת עבודה בצוות וקבלת ביקורת, בעל נורמות וערכים גבוהים, בעל ידע מקצועי רב","כל התשובות נכונות"],
        correct: 3
      },
      {
        q: "למי מהבאים אין גישה לתיק האישי של בחניך בקורס?",
        answers: ["קצינת משאן", "קהד גדודי", "מפקד הגדוד", "מדריכות וחונכות מקצועיות","משהד"],
        correct: 3
      },
      {
        q: "מה הנושאים שיש להעביר כחלק ממסמך העברת מקל? סמן את כל התשובות הנכונות",
        answers: ["פרטים אישיים אודות החניך", "מידע מקצועי", "התייחסות החניך למידע הנאמר עליו בהעברת מקל", "מידע אודות נורמות וערכי החניך"],
        correct: [0,1,3]
      },
      {
        q: "כל מידע בדוח העברת מקל יאושר על ידי מגד בבלבד?",
        answers: ["נכון","לא נכון"],
        correct: 1
      },
      {
        q:"החניך יהיה חשוף למידע המועבר עליו טרם ביצוע העברת מקל?",
        answers: ["נכון","לא נכון"],
        correct: 0
      },
      {
        q: "העברת המקל תכלול המלצות בקשר להמשך דרכו של החניך?",
        answers: ["נכון","לא נכון"],
        correct: 0
      },
      {
        q: "העברת המקל תתבצע אחרי שהחניך סיים קורס ועבר יחידה?",
        answers: ["נכון","לא נכון"],
        correct: 1
      },
    ]
  },

  "מ\"מ": {
    popupText: "ממ, להלן בוחן הדרכה בנושא תו תקן לאיכות בהכשרה. הבוחן הינו אישי ומטרתו הינה להעריך את בקיאותך בנהלי תו התקן והבנתך בתהליכי הדרכה. הנך רשאית להשתמש בכל חומר עזר. אין הגבלת זמן על השאלות. הציון העובר במבחן הינו 80,  בשאלות רב ברירה ינתן ניקוד רק על תשובה נכונה מלאה. בהצלחה! גפה ביסלח.",

    questions: [
      {
        q: "מה מהמופעים מתוך שעון ההדרכה הרלוונטים לרמת המחלקה?",
        answers: ["מסדר מחט לפני פתיחת מחזור", "חוודי אמצע וסוף - מפקדים וחניכים", "ראיונות פתיחה+חוזה חניכה", "סיכום אמצע הכשרה","כל התשובות נכונות"],
        correct: 4
      },
      {
        q: "סיכומים עיתיים הם סיכומים שנדרש לבצע בעת לעת במהלך ההכשרה על מנת לקבל החלטות באשר להמשך ההכשרה וכדי להפיק לקחים למחזור הא. לאיזה מהסיכומים המחלקתיים עלינו לבצע תיעעוד? בחר 2 תשובות נכונות",
        answers: ["סיכום יומי", "סיכום שבועי של החניכים", "סיכום אמצע מחזור", "סיכום לבנה מקצועית"],
        correct: [0,1]
      },
      {
        q: "מה מהנושאים הבאים יצויין בסיכום ההכשרה לחניכים? בחר את כל התשובות הנכונות",
        answers: ["תכנון מול ביצעו תכנים", "טיפול בפרט", "חוזקות וחולשות בכשירות החניכים, תכנית ההכשרה וההדרכה", "מנהלה ובטיחות","לקחים עיקריים בארבעת המימדים"],
        correct: [2,3,4]
      },
      {
        q: "איזה ידע נדרש לנהל בקמפוס? בחר את כל התשובות הנכונות",
        answers: ["מעקב הישגי חניכים ונוכחותם במופעים המהווים תנאי סף להסמכתו", "משובים וחוודים על החניך","ראיונות ושיחות אישיות", "תכנית חניכה והכשרה", "לוז הכשרה ספיציפי"],
        correct: [1,3,4]
      },
      {
        q: "תיק מדריך נכתב לכל לבנה מקצועית בהכשרה?",
        answers: ["נכון", "לא נכון"],
        correct: 1
      },
      {
        q: "תיק המדריך מהווה הכנה מקצועית ועוזר באחידות מקצועית?",
        answers: ["נכון", "לא נכון"],
        correct: 0
      },
      {
        q: "יש לעבור על תיק המדריך לפני כל שיעור?",
        answers: ["נכון", "לא נכון"],
        correct: 0
      },
      {
        q: "תיק המדריך מכיל גם מעקבים על נוכחות החניכים?",
        answers: ["נכון", "לא נכון"],
        correct: 1
      },
      {
        q: "תיקוף תיק המדריך יתבצע בעת שינוי תול / שיטת לימוד?",
        answers: ["נכון", "לא נכון"],
        correct: 0
      },
      {
        q: "מה ההרכב הרצוי לסגל חדש מול ותיק?",
        answers: ["30% סגל ותיק ו70% סגל חדש", "30% סגל חדש ו70% סגל ותיק", "50% סגל חדש ו50%סגל ותיק", "אין הגדרה חדש משמעית, תלוי באילוצי כח אדם"],
        correct: 2
      },
      {
        q: "מה נכון להגיד על תהליך איתור ומיון מפקדים? סמן את כל התשובות הנכונות",
        answers: ["סיום תהליך המיון יהיה לפחות שבוע לפני פתיחת המחזור", "היחיד שמעלה חניכים פוטנציאלים הוא המפ","מפקדים בגדוד ישארו למשך 8 חודשים לפחות אלא אם יצאו לקקצ","החניכים נבחרים על פי סוציומטרי חניכים"],
        correct: [0,2]
      },
      {
        q: "איזה מבחנים על מפקד לבצע על מנת לפתוח מחזור הכשרה?",
        answers: ["מבחן רובאות עיוני הכולל שאלות בנושאים: קליעה, שדאות, כושר קרבי ורפואה", "מבחן רמה, בטיחות, רובאות עיוני, בוחן קליעה מעשי ובוחן תו תקן עיוני", "מבחן רמה עיוני ומעשי, בוחן כשג מעשי, בוחן קליעה מעשי,בוחן הדרכה ובוחן מענה הפיקודי", "מבחן מודיעיני עיוני, בוחן תו תקן עיוני,בוחן כשג מעשי"],
        correct: 2
      },
      {
        q: "יניב הוא מכ שעתיד לפתוח מחזור שני בקורס מכים. הוא ידוע כמפקד טוב ואחראי. במהלך הכנת הסגל יניב נעדר ליומיים בשל אירוע משפחתי והפסיד סגירה מקצועית לשבוע פקלים וכן את בוחן הכשג ובוחן המקצועי. כיצד יש לנהוג?", 
        answers: ["יניב לא יוכל לפתוח את המחזור-יש לפנות למגד על מנת לאתר מפקד מחליף", "יניב נדרש להשלים את בוח הכשג בלבד. משום שהוא עתיד לפתוח מחזור שני ולא חייב בוחן וסגירה מקצועית.", "יש להשלים ליניב את כלל המבחנים שלא ביצע ולוודא שמשלים את תוכן הסגירה המקצועית טרם פתיחת המחזור", "נדרש לבצע את הבחנים ליניב כתנאי לפתיחת המחזור השלמת הסגירה המקצועית הינה אחרויותו בזמנו הפנוי"],
        correct: 2
      },
      {
        q: "מה הם מופעי החניכה המינימאליים שהנך מחוייב לבצע למפקדים תחתיך?",
        answers: ["לכל הפחות ארבעה מופעי חניכה במחזור, אחד מהם הוא על העברת שיעור", "לכל הפחות שני מופעי חניכה במחזור כאשר אחד מהם הוא על חניכה על חניכה","לכל הפחות שני מופעי חניכה שאחד מהם הוא על העברת תרגיל", "אף תשובה אינה נכונה"],
        correct: 1
      },
      {
        q: "מה מאפיין את תוכנית החניכה לאיש סגל?",
        answers: ["מתעדכנת אחת למחזור", "רלוונטית לכל מרכיבי הפיקוד- מקצועי, ערכי,פיקודי והדרכתי","לא חשופה לאיש הסגל-רק למפקדיו","נבנית בהתאם לחוזקות ולחולשות של איש הסגל","רלוונטית למכ בלבד"],
        correct: [0,1,3]
      },
      {
        q: "מי הסמכות להדיח ממ בהכשרה עקב פערים משמעותיים בביצוע התפקיד? בחר שתי תשובות נכונות",
        answers: ["מגד", "מפקד החטיבה-עבור ממ בסדיר", "קצין חיל ראשי-תאל עבור ממ בקבע", "במסגרת וועדה משותפת בראשות מפקד החטיבה"],
        correct: [1,2]
      },
      {
        q: "מהו תהליך סיום התפקיד לממ במקרה של פער בביצוע התפקיד?",
        answers: ["דיווח לרממ->וועדת מגד->וועדת מחט", "דיווח לרממ->שיחת משוב ובניית תוכנית חניכה->וועד מגד->וועדת מחט->וועדת קחצר","שיחת משוב ובניית תוכנית חניכה->וועדת מגד->וועדת מחט","דיווח לרממ->שיחת משוב ובניית תוכנית חניכה->וועדת מגד->וועדת מחט"],
        correct: 1
      },
        {
        q: "אילו תכנים מופיעים בתיק האישי לחניכה בקמד המקצועי? סמן את כל התשובות הנכונות",
        answers: ["ראיונות אישיים", "נוכחות בשיעורים", "סיכומי משובים", "חווד אמצע וסוף"],
        correct: [0,2,3]
      },
      {
        q: "חניכה על חניכה היא מופע בו מפקד חונך את המפקדים תחתיו על האופ בו הם מבצעים חניכה. אילו מבין הקריטריונים יש להעריך במסגרת זו? סמן את כל התשובות הנכונות",
        answers: ["אופן ביצוע התדריך של החונך לחניך טרם ביצוע המופע,מיקום החונך בזמן התצפית", "נקודת ההתעברות שמבצע החונך בזמן תצפית,אופן תיעוד התצפית","איתור התופעה הרלוונטית,שימוש בדף הערכה","אופן העברת המשוב והתמודדות עם התנגדויות החניך","כל התשובות נכונות"],
        correct: [4]
      },
      {
        q:"לכל חניך מתקשה נדרשת לבנות תוכנית לקידומו, מה התוכנית איננה כוללת?",
        answers: ["פירוט תחומי הקושי", "פירוט דרכי הפעולה לקידום החניך", "הגדרת יעדים עבור החניך לטווח הקצר","הגדרת השיבוץ החזוי לחניך"
        ],
        correct: 3
      },
       {
        q: "מהן דרכי הפעולה שעומדות בפני מפקד לסיוע לחניך מתקשה? סמן את כל התשובות הנכונות",
        answers: ["שעות תגבור פרטניות", "שימוש בחומר פתוח","התאמות במבחנים- הארכת זמן,הקראה וכו", "הצמדת חונך מקצועי - לדוגמא, משק עברית"],
        correct: [0,2,3]
      },
       {
        q: "מה מהבאים אינו קריטריון לבחירת חניך למופת?",
        answers: ["חווד מפקד בולט לחיוב", "סוציומטרי עמיתים גבוה", "ציוני מבחנים והתנסויות מעל 85", "ללא אירועי משמעת"],
        correct: 2
      },
      {
        q: "בחר מה הם הקריטריונים לסימון פוטנציאל מאותרים לפיקוד בהכשרה?",
        answers: ["יכולת העברת מסרים גבוהה, יכולת חניכה גבוהה", "יכולת הובלה ורתימה, יכולת למידה עצמית", "יכולת עבודה בצוות וקבלת ביקורת, בעל נורמות וערכים גבוהים, בעל ידע מקצועי רב","כל התשובות נכונות"],
        correct: 3
      },
      {
        q: "למי מהבאים אין גישה לתיק האישי של בחניך בקורס?",
        answers: ["קצינת משאן", "קהד גדודי", "מפקד הגדוד", "מדריכות וחונכות מקצועיות","משהד"],
        correct: 3
      },
      {
        q: "כיצד נדרשת להתבצע העברת מקל על הבוגר מההכשרה ליחידה הקולטת",
        answers: ["העברת דוח נתונים על הבוגר במייל ליחידה הקולטת", "העברת דוח נתונים ושיח מפקדים פיזי/טלפוני על כל בוגר", "במפגש פיזי בין המפקד המשלח למפקד הקולט", "באחריות שלישות היחידה"],
        correct: 1
      },
      {
        q: "כל מידע בדוח העברת מקל יאושר על ידי מגד בבלבד?",
        answers: ["נכון","לא נכון"],
        correct: 1
      },
      {
        q:"החניך יהיה חשוף למידע המועבר עליו טרם ביצוע העברת מקל?",
        answers: ["נכון","לא נכון"],
        correct: 0
      },
      {
        q: "העברת המקל תכלול המלצות בקשר להמשך דרכו של החניך?",
        answers: ["נכון","לא נכון"],
        correct: 0
      },
      {
        q: "העברת המקל תתבצע אחרי שהחניך סיים קורס ועבר יחידה?",
        answers: ["נכון","לא נכון"],
        correct: 1
      },
    ]
  },
"מ\"פ": {
    popupText: "מפ יקר, להלן בוחן הדרכה בנושא תו תקן לאיכות בהכשרה. הבוחן הינו אישי ומטרתו הינה להעריך את בקיאותך בנהלי תו התקן והבנתך בתהליכי הדרכה. הנך רשאית להשתמש בכל חומר עזר. אין הגבלת זמן על השאלות. הציון העובר במבחן הינו 80 , בשאלות רב ברירה ינתן ניקוד רק על תשובה נכונה מלאה. בהצלחה! גפה ביסלח.",

    questions: [
      {
        q: "בחר שני מופעים מתוך שעון ההדרכה הגדודי",
        answers: ["סכלת ממים חדשים", "סיכום שליש הכשרה", "העברת מקל לחטיבת אם", "ראיונות סוף+חוזה חניכה"],
        correct: [0,2]
      },
      {
        q: "בחר שני נושאים שיצוינו בתוכניות האישור לפתיחת ההכשרה",
        answers: ["מערכת שעות פרטנית", "שינוי תיק היסוד","סטטוס מימוש לקחים מסיכום קודם", "מאפייני מחזורים קודמים"],
        correct: [0,3]
      },
      {
        q: "סיכומים עיתיים הם סיכומים שנדרש לבצע בעת לעת במהלך ההכשרה על מנת לקבל החלטות באשר להמשך ההכשרה וכדי להפיק לקחים למחזור הבא. לאיזה מהסיכומים המחלקתיים עלינו לבצע תיעוד? בחר את כל התשובות נכונות",
        answers: ["סיכום יומי", "סיכום תרגיל כיתה/מחלקה", "סיכום שבועי של הסגל", "סיכום שבועות עצימים","סיכום אמצע מחזור"],
        correct: [2,3,4]
      },
      {
        q: "מה מהנושאים הבאים יצויין בסיכום ההכרשה לחניכים? בחר את כל התשובות הנכונות",
        answers: ["תכנון מול ביצוע תכנים", "טיפול בפרט", "חוזקות וחלשות בכשירות החניכים", "תכנית ההכשרה וההדרכה","מנהלה ובטיחות"],
        correct: [1,3,4]
      },
      {
        q: "איזה ידע נדרש לנהל בקמפוס הדיגיטלי? בחר את כל התשובות הנכונות",
        answers: ["מעקב הישגי חניכים ונכחותם בתכנים המהווים תנאי סף להכשרה","משובים וחוודים על החניך","ראיונות ושיחות אישיות","תכנית חניכה והערכה","לוז הכשרה ספיציפי"],
        correct: [0,1,2,3]
      },
      {
        q: "תיק מדריך נכתב לכל שיעור בהכשרה?",
        answers: ["נכון", "לא נכון"],
        correct: 0
      },
      {
        q: "תיק המדריך מהווה הכנה מקצועית ועוזר באחידות מקצועית?",
        answers: ["נכון", "לא נכון"],
        correct: 0
      },
      {
        q: "יש לעבור על תיק המדריך לפני כל שיעור?",
        answers: ["נכון", "לא נכון"],
        correct: 0
      },
      {
        q: "תיק המדריך מכיל גם מעקבים על נוכחות החניכים?",
        answers: ["נכון", "לא נכון"],
        correct: 1
      },
      {
        q: "תיקוף תיק המדריך יתבצע בעת שינוי תול / שיטת לימוד?",
        answers: ["נכון", "לא נכון"],
        correct: 0
      },
      {
        q: "מה ההרכב הרצוי לסגל חדש מול ותיק?",
        answers: ["30% סגל ותיק ו70% סגל חדש", "30% סגל חדש ו70% סגל ותיק", "50% סגל חדש ו50%סגל ותיק", "אין הגדרה חדש משמעית, תלוי באילוצי כח אדם"],
        correct: 2
      },
      {
        q: "איזה מבחנים על מפקד לבצע על מנת לפתוח מחזור הכשרה?",
        answers: ["מבחן רובאות עיוני הכולל שאלות בנושאים: קליעה, שדאות, כושר קרבי ורפואה", "מבחן רמה, בטיחות, רובאות עיוני, בוחן קליעה מעשי ובוחן תו תקן עיוני", "מבחן רמה עיוני ומעשי, בוחן כשג מעשי, בוחן קליעה מעשי,בוחן הדרכה ובוחן מענה הפיקודי", "מבחן מודיעיני עיוני, בוחן תו תקן עיוני,בוחן כשג מעשי"],
        correct: 2
      },
      {
        q: "יניב הוא מכ שעתיד לפתוח מחזור שני בקורס מכים. הוא ידוע כמפקד טוב ואחראי. במהלך הכנת הסגל יניב נעדר ליומיים בשל אירוע משפחתי והפסיד סגירה מקצועית לשבוע פקלים וכן את בוחן הכשג והוחן המקצועי. כיצד יש לנהוג?", 
        answers: ["יניב לא יוכל לפתוח את המחזור-יש לפנות למגד על מנת לאתר מפקד מחליף", "יניב נדרש להשלים את בוח הכשג בלבד. משום שהוא עתיד לפתוח מחזור שני ולא חייב בוחן וסגירה מקצועית.", "יש להשלים ליניב את כלל המבחנים שלא ביצע ולוודא שמשלים את תוכן הסגירה המקצועית טרם פתיחת המחזור", "נדרש לבצע את הבחנים ליניב כתנאי לפתיחת המחזור השלמת הסגירה המקצועית הינה אחרויותו בזמנו הפנוי"],
        correct: 2
      },
      {
        q: "כחלק מתהליך בניית הכנת סגל על המפ לבצע אבחון מקדים. מה הם הנושאים שנדרש לקחת בחשבון באבחון?",
        answers: ["תמהיל המפקדים-ותיקים מול חדשים והניסיון הפיקודי והמבצעי שלהם", "לקחים מסיכום הכנות סגל קודמות","לקחים מסיכום מחזור אחרון","נבנית בהתאם לחוזקות ולחולשות של איש הסגל","כל התשובות נכונות"],
        correct: 3
      },
      {
        q: "משך הכנת הסגל ועיתוי הביצוע שלה לא תמיד מאפשר לבצע הכנה רלוונטית ומעמיקה לכלל השבועות. מה אתה מחוייב לבצע על מנת להתמודד עם האתגר על פי תו התקן?",
        answers: ["לבנות תכנית למידה עצמית למפקדים תוך כדי מחזור", "לחלק את סגל המפקדים למגמות התמחות","לבנות תוכנית הכנת מפקדים המתבצעת תוך כדי המחזור", "לקבל סיוע ממדריכות אשר ילמדו ויתרגלו במקום המפקדים למקרה הצורך"],
        correct: [0,2]
      },
      {
        q: "מהם מופעי החניכה המינימאליים שהנך מחויב לבצע לממים תחתיך ושהממים מחויבים לבצע למפקדים תחתיהם?",
        answers: ["לכל הפחות ארבעה מופעי חניכה במחזור ואחד מהם לפחות על העברת שיעור", "לכל הפחות שני מופעי חניכה שאחד מהם לפחות הוא על חניכה על חניכה", "לכל הפחות שני מופעי חניכה שאחד מהם לפחות הוא על העברת תרגיל", "אף תשובה אינה נכונה"
        ],
        correct: 1
      },
      {
        q: "מה מאפיין את תכנית החניכה לאיש סגל? סמן את כל התשובות הנכונות",
        answers: ["מתעכנת אחת למחזור", "רלוונטית לכל מרכיבי התפקיד-מקצועי,הדרכתי,פיקודי וערכי", "לא חשופה לאיש הסגל-רק למפקדיו", "נבנית בהתאם לחוזקות וחולשות של איש הסגל","רלוונטית לממ ולמכ בלבד"],
        correct:[0,1,3]
      },
      {
        q: "מי הסמכות להדיח מפ בהכשרה בעקבות פערים משמעותיים בביצוע התפקיד",
        answers: ["מגד", "מפקד הבהד", "קצין חיל ראשי/מהי", "במסגרת וועדה משותפת בראשות מפקד היחידה"],
        correct: 2
      },
      {
        q: "חניכה על חניכה היא מופע בו מפקד חונך את המפקדים תחתיו על האופ בו הם מבצעים חניכה. אילו מבין הקריטריונים יש להעריך במסגרת זו? סמן את כל התשובות הנכונות",
        answers: ["אופן ביצוע התדריך של החונך לחניך טרם ביצוע המופע,מיקום החונך בזמן התצפית", "נקודת התהערבות שמבצע החונך בזמן תצפית,אופן תיעוד התצפית","איתור התופעה הרלוונטית,שימוש בדף הערכה","אופן העברת המשוב והתמודדות עם התנגדויות החניך","כל התשובות נכונות"],
        correct: [4]
      },
       {
        q:"לכל חניך מתקשה נדרשת לבנות תוכנית לקידומו, מה התוכנית איננה כוללת?",
        answers: ["פירוט תחומי הקושי", "פירוט דרכי הפעולה לקידום החניך", "הגדרת יעדים עבור החניך לטווח הקצר","הגדרת השיבוץ החזוי לחניך"
        ],
        correct: 3
      },
       {
        q: "מהן דרכי הפעולה שעומדות בפני מפקד לסיוע לחניך מתקשה? סמן את כל התשובות הנכונות",
        answers: ["שעות תגבור פרטניות", "שימוש בחומר פתוח","התאמות במבחנים- הארכת זמן,הקראה וכו", "הצמדת חונך מקצועי - לדוגמא, משק עברית"],
        correct: [0,2,3]
      },
       {
        q: "מה מהבאים אינו קריטריון לבחירת חניך למופת?",
        answers: ["חווד מפקד בולט לחיוב", "סוציומטרי עמיתים גבוה", "ציוני מבחנים והתנסויות מעל 85", "ללא אירועי משמעת"],
        correct: 2
      },
      {
        q: "מה מהבאים אינו חלק מאיתור חניכים לפיקוד בהכשרות?",
        answers: ["תהליך המתבצע בכלל הכשרות הפיקוד", "מטרת התהליך לזהות ולסמן חניכים בעלי יכולות ספיציפיות לתפקיד מפקד בהכשרה", "מחייב הגדרת מופעי איתור נוספים במהלך ההכשרה","מתבצע אל מול הקריטריונים המוגדרים אשר נדרשים ממפקדים בהכשרות"],
        correct: 2
      },
      {
        q: "למי מהבאים אין גישה לתיק האישי של בחניך בקורס?",
        answers: ["קצינת משאן", "קהד גדודי", "מפקד הגדוד", "מדריכות וחונכות מקצועיות","משהד"],
        correct: 3
      },
      {
        q: "כיצד נדרשת להתבצע העברת מקל על הבוגר מההכשרה ליחידה הקולטת",
        answers: ["העברת דוח נתונים על הבוגר במייל ליחידה הקולטת", "העברת דוח נתונים ושיח מפקדים פיזי/טלפוני על כל בוגר", "במפגש פיזי בין המפקד המשלח למפקד הקולט", "באחריות שלישות היחידה"],
        correct: 1
      },
      {
        q: "כל מידע בדוח העברת מקל יאושר על ידי מגד בבלבד?",
        answers: ["נכון","לא נכון"],
        correct: 1
      },
      {
        q:"החניך יהיה חשוף למידע המועבר עליו טרם ביצוע העברת מקל?",
        answers: ["נכון","לא נכון"],
        correct: 0
      },
      {
        q: "העברת המקל תכלול המלצות בקשר להמשך דרכו של החניך?",
        answers: ["נכון","לא נכון"],
        correct: 0
      },
      {
        q: "העברת המקל תתבצע אחרי שהחניך סיים קורס ועבר יחידה?",
        answers: ["נכון","לא נכון"],
        correct: 1
      },
    ]
  },
  "קה\"ד/ית": {
    popupText: "קהד/ית יקר/ה, להלן בוחן הדרכה בנושא תו תקן לאיכות בהכשרה. הבוחן הינו אישי ומטרתו הינה להעריך את בקיאותך בנהלי תו התקן והבנתך בתהליכי הדרכה. הנך רשאית להשתמש בכל חומר עזר. אין הגבלת זמן על השאלות. הציון העובר במבחן הינו 80 , בשאלות רב ברירה ינתן ניקוד רק על תשובה נכונה מלאה. בהצלחה! גפה ביסלח.",

    questions: [
      {
        q: "בחר 2 מופעים מתוך שעון ההדרכה הגדודי שאתה אחראי עליהם",
        answers: ["ראיונות סוף+חוזה חניכה", "העברות מקל לחטיבות אם", "אישור תוכניות דו שבועי", "מסדר מגד לפני פתיחת מחזור"],
        correct: [1,3]
      },
      {
        q: "סיכומים עיתיים הם סיכומים שנדרש לבצע בעת לעת במהלך ההכשרה על מנת לקבל החלטות באשר להמשך ההכשרה וכדי להפיק לקחים למחזור הא. לאיזה מהסיכומים המחלקתיים עלינו לבצע תיעוד? בחר את כל התשובות נכונות",
        answers: ["סיכום יומי", "סיכום תרגיל כיתה/מחלקה", "סיכום שבועי ", "סיכום שבועות עצימים","סיכום אמצע מחזור"],
        correct: [0,2,3,4]
      },
      {
        q: "מה הנושאים יצויין בסיכום ההכשרה למפקדים? בחר את כל התשובות הנכונות",
        answers: ["תכנון מול ביצוע תכנים וכשירויות", "טיפול בפרט", "ציוני חניכים במבחנים מרכזיים בהכשרה", "פערי מנהלה ובטיחות","לקחים עיקריים בארבעת המימדים"],
        correct: [1,2,4]
      },
      {
        q: "קהד הינו הגורם האמון על הקמפוס הדיגיטלי,איזה ידע עלייך לוודא שמוזן שם? בחר את התשובות הנכונות",
        answers: ["מעקב הישגי חניכים ונוכחותם במופעים המהווים תנאי סף להסמכתם", "משובים וחוודים על החניך", "ראיונות ושיחות אישיות", "תכנית החניכה והערכה","לוז הכשרה פרטני"],
        correct: [0,1,2,3]
      },
      {
        q: "ביקורת תלב תערך בגדוד בכל אמצע מחזור על ידי הגפה ובאחריות הקהדית לבצע ביקורת פנימית מקדימה. מה הבקרה תכלול? בחר את כל התשובת הנכונות",
        answers: ["שיחת חתך מפקדים וחניכים", "מעבר על ממצאי ביקורות קודמות","ביצוע מבחן נהלים","שיחת מפ","כל דגש נוסף על פי בקשת מגד"],
        correct: [0,1,3,4]
      },
      {
        q: "מהו עץ הערכה?",
        answers: ["כלי המאגד את רשימת הכשירויות בהכשרה", "כלי המסביר על סוג המבחנים וההתנסויות הנערכים לחניכים בהכרשה","כלי המשקף את רמת הכשירות של החניכים בכל מרכיבי התפקיד","כלי באמצעותוממשב המפקד את חניכיו בהתנסויות המבחנים השונים"],
        correct: 2
      },
      {
        q: "תיק מדריך נכתב לכל שיעור בהכשרה?",
        answers: ["נכון", "לא נכון"],
        correct: 0
      },
      {
        q: "תיק המדריך מהווה הכנה מקצועית ועוזר באחידות מקצועית?",
        answers: ["נכון", "לא נכון"],
        correct: 0
      },
      {
        q: "יש לעבור על תיק המדריך לפני כל שיעור?",
        answers: ["נכון", "לא נכון"],
        correct: 0
      },
      {
        q: "תיק המדריך מכיל גם מעקבים על נוכחות החניכים?",
        answers: ["נכון", "לא נכון"],
        correct: 1
      },
      {
        q: "תיקוף תיק המדריך יתבצע בעת שינוי תול / שיטת לימוד?",
        answers: ["נכון", "לא נכון"],
        correct: 0
      },
      {
        q: "מה ההרכב הרצוי לסגל חדש מול ותיק?",
        answers: ["30% סגל ותיק ו70% סגל חדש", "30% סגל חדש ו70% סגל ותיק", "50% סגל חדש ו50%סגל ותיק", "אין הגדרה חדש משמעית, תלוי באילוצי כח אדם"],
        correct: 2
      },
      {
        q: "איזה מבחנים על מפקד לבצע על מנת לפתוח מחזור הכשרה?",
        answers: ["מבחן רובאות עיוני הכולל שאלות בנושאים: קליעה, שדאות, כושר קרבי ורפואה", "מבחן רמה, בטיחות, רובאות עיוני, בוחן קליעה מעשי ובוחן תו תקן עיוני", "מבחן רמה עיוני ומעשי, בוחן כשג מעשי, בוחן קליעה מעשי,בוחן הדרכה ובוחן מענה הפיקודי", "מבחן מודיעיני עיוני, בוחן תו תקן עיוני,בוחן כשג מעשי"],
        correct: 2
      },
      {
        q: "יניב הוא מכ שעתיד לפתוח מחזור שני בקורס מכים. הוא ידוע כמפקד טוב ואחראי. במהלך הכנת הסגל יניב נעדר ליומיים בשל אירוע משפחתי והפסיד סגירה מקצועית לשבוע פקלים וכן את בוחן הכשג ובוחן המקצועי. כיצד יש לנהוג?", 
        answers: ["יניב לא יוכל לפתוח את המחזור-יש לפנות למגד על מנת לאתר מפקד מחליף", "יניב נדרש להשלים את בוח הכשג בלבד. משום שהוא עתיד לפתוח מחזור שני ולא חייב בוחן וסגירה מקצועית.", "יש להשלים ליניב ת כלל המבחנים שלא ביצע ולוודא שמשלים את תוכן הסגירה המקצועית טרם פתיחת המחזור", "נדרש לבצע את הבחנים ליניב כתנאי לפתיחת המחזור השלמת הסגירה המקצועית הינה אחרויותו בזמנו הפנוי"],
        correct: 2
      },
      {
        q: "מהם מופעי החניכה המינימאליים שמפקד מחויב להעביר לפקודו לאורך ההכשרה?",
        answers: ["לכל הפחות ארבעה מופעי חניכה במחזור ואחד מהם לפחות על העברת שיעור", "לכל הפחות שני מופעי חניכה שאחד מהם לפחות הוא על חניכה על חניכה", "לכל הפחות שני מופעי חניכה שאחד מהם לפחות הוא על העברת תרגיל", "אף תשובה אינה נכונה"
        ],
        correct: 1
      },
      {
        q: "מה מאפיין את תכנית החניכה לאיש סגל? סמן את כל התשובות הנכונות",
        answers: ["מתעדכנת אחת למחזור", "רלוונטית לכל מרכיבי התפקיד-מקצועי,הדרכתי,פיקודי וערכי", "לא חשופה לאיש הסגל-רק למפקדיו", "נבנית בהתאם לחוזקות וחולשות של איש הסגל","רלוונטית לממ ולמכ בלבד"],
        correct:[0,1,3]
      },,
      {
        q: "חניכה על חניכה היא מופע בו מפקד חונך את המפקדים תחתיו על האופ בו הם מבצעים חניכה. אילו מבין הקריטריונים יש להעריך במסגרת זו? סמן את כל התשובות הנכונות",
        answers: ["אופן ביצוע התדריך של החונך לחניך טרם ביצוע המופע,מיקום החונך בזמן התצפית", "נקודת ההתערבות שמבצע החונך בזמן תצפית,אופן תיעוד התצפית","איתור התופעה הרלוונטית,שימוש בדף הערכה","אופן העברת המשוב והתמודדות עם התנגדויות החניך","כל התשובות נכונות"],
        correct: [4]
      },
      {
        q: "מה מהבאים אינו תפקידה של הקהדית בעת כניסת בעל תפקיד חדש לגדוד?",
        answers: ["בניית גאנט כניסה לתפקיד", "כתיבת מסמך סיכום לתהליך הכניסה של לתפקיד של בעל התפקיד", "וידוא העברת תיק חפיפה מבעל התפקיד היוצא לנכנס", "העברת תכני הדרכה לרבות תיק יסוד,תפיסת ההדרכה ועוד"
        ],
        correct: 1
      },
      {
        q: "חניך מתקשה הינו חניך שמאותר אצלו פער בעמידה בהישגים הנדרשים בהכרשה ונדרש לבנות לו תוכנית אישית. סמן מה לא צריך שהתוכנית תכלול",
        answers: ["פירוט תחומי הקושי", "פירוט דרכי הפעולה לקידום החניך", "הגדרת יעדים עבור החניך לטווח קצר", "הגדרת השיבוץ החזוי לחניך"],
        correct: 3
      },
      {
        q: "מה דרכי הפעולה העומדות בפני מפקד לסיוע לחניך מתקשה? סמן את כל התשובות הנכונת",
        answers: ["שעות תגבור פרטניות", "שימוש בחומר פתוח", "התאמות במבחנים-לדוגמא הארכות זמן,הקראות, מבחן בעל פה", "הצמדת חונך מקצועי- לדומגא משק עברית"],
        correct: [0,2,3]
      },
      {
        q: "כיצד נדרשת להתבצע העברת מקל על הבוגר מההכשרה ליחידה הקולטת",
        answers: ["העברת דוח נתונים על הבוגר במייל ליחידה הקולטת", "העברת דוח נתונים ושיח מפקדים פיזי/טלפוני על כל בוגר", "במפגש פיזי בין המפקד המשלח למפקד הקולט", "באחריות שלישות היחידה"],
        correct: 1
      },
      {
        q: "כל מידע בדוח העברת מקל יאושר על ידי מגד בבלבד?",
        answers: ["נכון","לא נכון"],
        correct: 1
      },
      {
        q:"החניך יהיה חשוף למידע המועבר עליו טרם ביצוע העברת מקל?",
        answers: ["נכון","לא נכון"],
        correct: 0
      },
      {
        q: "העברת המקל תכלול המלצות בקשר להמשך דרכו של החניך?",
        answers: ["נכון","לא נכון"],
        correct: 0
      },
      {
        q: "העברת המקל תתבצע אחרי שהחניך סיים קורס ועבר יחידה?",
        answers: ["נכון","לא נכון"],
        correct: 1
      },
      
    ]
  },

  "משה\"ד": {
    popupText: "משהד יקר, להלן בוחן הדרכה בנושא תו תקן לאיכות בהכשרה. הבוחן הינו אישי ומטרתו הינה להעריך את בקיאותך בנהלי תו התקן והבנתך בתהליכי הדרכה. הנך רשאית להשתמש בכל חומר עזר. אין הגבלת זמן על השאלות. הציון העובר במבחן הינו 80, בשאלות רב ברירה ינתן ניקוד רק על תשובה נכונה מלאה. בהצלחה! גפה ביסלח.",

    questions: [
      {
        q: "מהו תו התקן?",
        answers: ["רשין כשיר להכשיר", "מסמך המייצר סטנדרט אחיד בתהליכי הדרכה", "מסמך שמרכז את המענה הפיקודי","מסמך המרכז את הנהלים למענה הפיקודי בהכשרה"],
        correct: 1
      },
      {
        q: "מהו שעון הדרכה והאם רלוונטי לדרגת המכ?",
        answers: ["רשימת מופעי הדרכה גדודיים בחלוקה לשבועות-רלוונטי לכל רמות הפיקוד","לוז מפ המכיל את מופעי הפלוגה-רלוונטי לרמת הממ ומעלה","רשימת עוגנים שבועיים בהכרשה-רלוונטי לכל רמות הפיקוד","לוז גדודי עם מופעי הדרכה המשמש את המפ לבניית לוז פלוגתי-רלוונטי לרמת המפ"],
        correct: 0
      },
      {
        q: "מה מהנושאים הבאים יצויין בסיכום ההכשרה לחניכים? בחר את כל התשובות הנכונות",
        answers: ["תכנון מול ביצוע תכנים", "טיפול בפרט", "חוזקות וחולשות בכשירות החניכים", "תכנית ההכשרה וההדרכה", "מנהלה ובטיחות"],
        correct: [1,3,4]
      },
      {
        q: "איזה ידע נדרש לנהל בקמפוס הדיגיטלי? בחר את כל התשובות הנכונות",
        answers: ["מעקב הישגי החניכים ונוכחותם במופעים המהווים תנאי סף להכשרה", "משוב וחוודים על החניך", "ראיונות ושיחות אישיות", "תכנית החניכה והערכה", "לוז הכשרה ספיציפי"],
         correct: [0,1,2,3]
      },
           {
        q: "תיק מדריך נכתב לכל לבנה מקצועית בהכשרה?",
        answers: ["נכון", "לא נכון"],
        correct: 1
      },
      {
        q: "תיק המדריך מהווה הכנה מקצועית ועוזר באחידות מקצועית?",
        answers: ["נכון", "לא נכון"],
        correct: 0
      },
      {
        q: "יש לעבור על תיק המדריך לפני כל שיעור?",
        answers: ["נכון", "לא נכון"],
        correct: 0
      },
      {
        q: "תיק המדריך מכיל גם מעקבים על נוכחות החניכים?",
        answers: ["נכון", "לא נכון"],
        correct: 1
      },
      {
        q: "תיקוף תיק המדריך יתבצע בעת שינוי תול / שיטת לימוד?",
        answers: ["נכון", "לא נכון"],
        correct: 0
      },
      {
        q: "איזה מבחנים על מפקד לבצע על מנת לפתוח מחזור הכשרה?",
        answers: ["מבחן רובאות עיוני הכולל שאלות בנושאים: קליעה, שדאות, כושר קרבי ורפואה", "מבחן רמה, בטיחות, רובאות עיוני, בוחן קליעה מעשי ובוחן תו תקן עיוני", "מבחן רמה עיוני ומעשי, בוחן כשג מעשי, בוחן קליעה מעשי,בוחן הדרכה ובוחן מענה הפיקודי", "מבחן מודיעיני עיוני, בוחן תו תקן עיוני,בוחן כשג מעשי"],
        correct: 2
      },
      {
        q: "יניב הוא מכ שעתיד לפתוח מחזור שני בקורס מכים. הוא ידוע כמפקד טוב ואחראי. במהלך הכנת הסגל יניב נעדר ליומיים בשל אירוע משפחתי והפסיד סגירה מקצועית לשבוע פקלים וכן את בוחן הכשג והוחן המקצועי. כיצד יש לנהוג?", 
        answers: ["יניב לא יוכל לפתוח את המחזור-יש לפנות למגד על מנת לאתר מפקד מחליף", "יניב נדרש להשלים את בוח הכשג בלבד. משום שהוא עתיד לפתוח מחזור שני ולא חייב בוחן וסגירה מקצועית.", "יש להשלים ליניב את כלל המבחנים שלא ביצע ולוודא שמשלים את תוכן הסגירה המקצועית טרם פתיחת המחזור", "נדרש לבצע את הבחנים ליניב כתנאי לפתיחת המחזור השלמת הסגירה המקצועית הינה אחרויותו בזמנו הפנוי"],
        correct: 2
      },
      {
        q: "מהם מופעי החניכה המינימאליים שהנך מחוייב לעבור על ידי מפקדך הישיר?",
        answers: ["לפחות ארבעה, לפחות אחד על העברת שיעור", "לכל הפחות שני מופעים, אחד על חניכה על חניכה","לכל הפחות שני מופעים, אחד מהם על העברת תרגיל", "אף תשובה אינה נכונה"],
        correct: 1
      },
      {
        q: "מה מאפיין את תוכנית החניכה לאיש סגל? ",
        answers: ["מתעדכנת אחת למחזור", "רלוונטית לכל מריכבי הפיקוד- מקצועי, ערכי,פיקודי והדרכתי","לא חשופה לאיש הסגל-רק למפקדיו","נבנית בהתאם לחוזקות ולחולשות של איש הסגל","רלוונטית למכ בלבד"],
        correct: [0,1,3]
      },
       {
        q: "מהו תהליך סיום התפקיד למכ במקרה של פער בביצוע התפקיד?",
        answers: ["דיווח לרממ->וועדת מגד->וועדת מחט", "דיווח לרממ->שיחת משוב ובניית תוכנית חניכה->וועד מגד->וועדת מחט->וועדת קחצר","שיחת משוב ובניית תוכנית חניכה->וועדת מגד->וועדת מחט","דיווח לרממ->שיחת משוב ובניית תוכנית חניכה->וועדת מגד->וועדת מחט"],
        correct: 3
      },
       {
        q: "חניכה על חניכה היא מופע בו מפקד חונך את המפקדים תחתיו על האופ בו הם מבצעים חניכה. אילו מבין הקריטריונים יש להעריך במסגרת זו? סמן את כל התשובות הנכונות",
        answers: ["אופן ביצוע התדריך של החונך לחניך טרם ביצוע המופע,מיקום החונך בזמן התצפית", "נקודת ההתערבות שמבצע החונך בזמן תצפית,אופן תיעוד התצפית","איתור התופעה הרלוונטית,שימוש בדף הערכה","אופן העברת המשוב והתמודדות עם התנגדויות החניך","כל התשובות נכונות"],
        correct: [4]
      },
       {
        q:"לכל חניך מתקשה נדרשת לבנות תוכנית לקידומו, מה התוכנית איננה כוללת?",
        answers: ["פירוט תחומי הקושי", "פירוט דרכי הפעולה לקידום החניך", "הגדרת יעדים עבור החניך לטווח הקצר","הגדרת השיבוץ החזוי לחניך"
        ],
        correct: 3
      },
       {
        q: "מהן דרכי הפעולה שעומדות בפני מפקד לסיוע לחניך מתקשה? סמן את כל התשובות הנכונות",
        answers: ["שעות תגבור פרטניות", "שימוש בחומר פתוח","התאמות במבחנים- הארכת זמן,הקראה וכו", "הצמדת חונך מקצועי - לדוגמא, משק עברית"],
        correct: [0,2,3]
      },
       {
        q: "מה מהבאים אינו קריטריון לבחירת חניך למופת?",
        answers: ["חווד מפקד בולט לחיוב", "סוציומטרי עמיתים גבוה", "ציוני מבחנים והתנסויות מעל 85", "ללא אירועי משמעת"],
        correct: 1
      },
      {
        q: "החניך יוסי עבר כבר חצי ממהכשרה וציוניו מעים בין 70-60 האם יוסי יודח מההכשרה?",
        answers: ["לא,ציון הסף לסיום ההכשרה הוא 60 ובמידה ויעבור אותו אין סיבה להדחה", "לא,ישנם גם שיקולים ערכיים משמעתיים שמדובר בהדחה", "כן,אם ימשיך במגמה זו לאחר שיחת שיקוף ותכנית חניכה עם מפקדיו","כל התשובות נכונות"],
        correct: 2
      },
       {
        q: "מה מהבאים אינו חלק מאיתור חניכים לפיקוד בהכשרות?",
        answers: ["תהליך המתבצע בכלל הכשרות הפיקוד", "מטרת התהליך לזהות ולסמן חניכים בעלי יכולות ספיציפיות לתפקיד מפקד בהכשרה", "מחייב הגדרת מופעי איתור נוספים במהלך ההכשרה","מתבצע אל מול הקריטריונים המוגדרים אשר נדרשים ממפקדים בהכשרות"],
        correct: 2
      },
      {
        q: "למי מהבאים אין גישה לתיק האישי של בחניך בקורס?",
        answers: ["קצינת משאן", "קהד גדודי", "מפקד הגדוד", "מדריכות וחונכות מקצועיות","משהד"],
        correct: 3
      },
      {
        q: "מהם הנושאים שיש להעביר כחלק ממסמך העברת מקל?",
        answers: ["פרטים אישיים של החניך", "מידע מקצועי", "התייחסות החניך למידע הנאמר עליו בהעברת מקל", "מידע אודות נורמות וערכי החניך"],
        correct: [0,1,3]
      },
      {
        q: "כל מידע בדוח העברת מקל יאושר על ידי מגד בבלבד?",
        answers: ["נכון","לא נכון"],
        correct: 1
      },
      {
        q:"החניך יהיה חשוף למידע המועבר עליו טרם ביצוע העברת מקל?",
        answers: ["נכון","לא נכון"],
        correct: 0
      },
      {
        q: "העברת המקל תכלול המלצות בקשר להמשך דרכו של החניך?",
        answers: ["נכון","לא נכון"],
        correct: 0
      },
      {
        q: "העברת המקל תתבצע אחרי שהחניך סיים קורס ועבר יחידה?",
        answers: ["נכון","לא נכון"],
        correct: 1
      },
    ]
  }
};
const dropdown = document.getElementById("roleDropdown");
setupDropdown("roleDropdown");
setupDropdown("branchDropdown");

function setupDropdown(dropdownId) {

    const dropdown = document.getElementById(dropdownId);

    if (!dropdown) return;

    const selected = dropdown.querySelector(".dropdownSelected");

    const list = dropdown.querySelector(".dropdownList");

    const items = dropdown.querySelectorAll(".dropdownItem");

    selected.onclick = () => {

        list.style.display =
            list.style.display === "block"
            ? "none"
            : "block";
    };

    items.forEach(item => {

        item.onclick = () => {

            selected.innerText = item.innerText;

            list.style.display = "none";
        };
    });

    document.addEventListener("click", (e) => {

        if (!dropdown.contains(e.target)) {

            list.style.display = "none";
        }
    });
}
function submitForm() {

    const role =
        document.querySelector("#roleDropdown .dropdownSelected")
        ?.innerText;

    const branch =
        document.querySelector("#branchDropdown .dropdownSelected")
        ?.innerText;

    if (role === "תפקיד" || branch === "ענף") {

        alert("יש לבחור תפקיד וענף");

        return;
    }

    const userData = {
        role: role.trim(),
        branch: branch.trim(),
        fullName: document.getElementById("fullName").value,
        personalNumber: document.getElementById("personalNumber").value
    };

    localStorage.setItem(
        "userData",
        JSON.stringify(userData)
    );

    window.location.href = "test.html";
}


let currentIndex = 0;
let score = 0;

function openPopup(text) {
    document.getElementById("popupText").innerText = text;

    document.getElementById("popup").style.display = "block";
    document.getElementById("overlay").style.display = "block";
}

function closePopup() {
    document.getElementById("popup").style.display = "none";
    document.getElementById("overlay").style.display = "none";
}

/* ---------------- QUIZ ---------------- */

const questionText = document.getElementById("questionText");

const answersContainer = document.getElementById("answersContainer");

const currentQuestionSpan = document.getElementById("currentQuestion");

const totalQuestionsSpan = document.getElementById("totalQuestions");

let currentQuestionIndex = 0;

let quizScore = 0;

/* בדיקה שאנחנו באמת ב-test.html */
if (window.location.pathname.includes("test.html")) {

    const userData = JSON.parse(localStorage.getItem("userData"));

    if (userData) {

        const role = userData.role;

        const quiz = quizData[role];

        if (quiz) {

            totalQuestionsSpan.innerText = quiz.questions.length;

            showQuestion();
        }
    }
}

function showQuestion() {

    const userData = JSON.parse(localStorage.getItem("userData"));

    const role = userData.role;

    const quiz = quizData[role];

    const currentQuestion = quiz.questions[currentQuestionIndex];

    questionText.innerText = currentQuestion.q;

    if (currentQuestion.q.length > 55) {
        questionText.classList.add("smallQuestion");
    } else {
        questionText.classList.remove("smallQuestion");
    }

    currentQuestionSpan.innerText = currentQuestionIndex + 1;

    answersContainer.innerHTML = "";

    const isMultiple = Array.isArray(currentQuestion.correct);

    currentQuestion.answers.forEach((answer, index) => {

        const button = document.createElement("button");

        button.classList.add("answerBtn");

        button.innerText = answer;

        if (isMultiple) {

            button.onclick = () => {
                button.classList.toggle("selected");
            };

        } else {

            button.onclick = () => {
                checkAnswer(index);
            };
        }

        answersContainer.appendChild(button);
    });

    if (isMultiple) {

        const submitBtn = document.createElement("button");

        submitBtn.innerText = "בדיקה";

        submitBtn.classList.add("checkBtn");

        submitBtn.onclick = checkMultipleAnswers;

        answersContainer.appendChild(submitBtn);
    }
}

function checkAnswer(selectedIndex) {

    const userData = JSON.parse(localStorage.getItem("userData"));

    const role = userData.role;

    const quiz = quizData[role];

    const currentQuestion = quiz.questions[currentQuestionIndex];

    const allButtons = document.querySelectorAll(".answerBtn");

    allButtons.forEach(button => {
        button.classList.add("disabled");
    });

    /* נכון */
    if (selectedIndex === currentQuestion.correct) {

        allButtons[selectedIndex].classList.add("correct");

        quizScore += 5;
    }

    /* לא נכון */
    else {

        allButtons[selectedIndex].classList.add("wrong");

        allButtons[currentQuestion.correct].classList.add("correct");
    }

    sessionStorage.setItem("quizScore", quizScore);

    /* מעבר אוטומטי לשאלה הבאה */
    setTimeout(() => {

        nextQuestion();

    }, 1500);
}
function nextQuestion() {

    const userData = JSON.parse(localStorage.getItem("userData"));

    const role = userData.role;

    const quiz = quizData[role];

    currentQuestionIndex++;

    if (currentQuestionIndex >= quiz.questions.length) {

        showFinalPopup();

        return;
    }

    showQuestion();
}

function checkMultipleAnswers() {

    const userData = JSON.parse(localStorage.getItem("userData"));

    const role = userData.role;

    const quiz = quizData[role];

    const currentQuestion = quiz.questions[currentQuestionIndex];

    const correctAnswers = currentQuestion.correct;

    const allButtons = document.querySelectorAll(".answerBtn");

    let selectedIndexes = [];

    allButtons.forEach((button, index) => {

        if (button.classList.contains("selected")) {
            selectedIndexes.push(index);
        }

        button.classList.add("disabled");
    });

    let isCorrect =
        selectedIndexes.length === correctAnswers.length &&
        selectedIndexes.every(index => correctAnswers.includes(index));

    allButtons.forEach((button, index) => {

        if (correctAnswers.includes(index)) {
            button.classList.add("correct");
        }

        else if (button.classList.contains("selected")) {
            button.classList.add("wrong");
        }
    });

    if (isCorrect) {
        quizScore += 5;
    }

    sessionStorage.setItem("quizScore", quizScore);

    /* מעבר אוטומטי לשאלה הבאה */
    setTimeout(() => {

        nextQuestion();

    }, 1500);
}

function showFinalPopup() {

    const userData = JSON.parse(localStorage.getItem("userData"));

    const role = userData.role;

    const branch = userData.branch;

    let targetEmail = "";

    // switch(branch) {

    //     case "חשיפה תקיפה":
    //         targetEmail = "guyleeneuman@gmail.com";
    //         break;

    //     case "רק\"ם מתקדם":
    //         targetEmail = "guyleeneuman@gmail.com";
    //         break;

    //     default:
    //         targetEmail = "guyleeneuman@gmail.com";
    // }

    const quiz = quizData[role];

    const totalQuestions = quiz.questions.length;

    const correctAnswersCount = quizScore / 5;

    /* חישוב אחוזים */
    const percent = Math.round(
        (quizScore / (totalQuestions * 5)) * 100
    );

    /* צבע לפי ציון */
    const percentColor =
        percent >= 80
        ? "rgba(3, 90, 16, 1)"
        : "rgba(163, 11, 13, 1)";

    /* הודעת נכשל */
    const failedMessage =
        percent < 80
        ? `<p class="retryText">
                יש לבצע את המבחן פעם נוספת
           </p>`
        : "";

    document.getElementById("overlay").style.display = "block";

    const endPopup = document.createElement("div");

    endPopup.classList.add("popup");

    endPopup.innerHTML = `
    
        <img class="popUpbg" src="assets/elements/endPopUp.png">

        <p class="popUpTextEnd endText">

            ענית נכון על 

            <span>${correctAnswersCount}</span>
            מתוך <span>${totalQuestions}</span>

            <br>

            ציון סופי:

            <span style="color:${percentColor}">
                ${percent}%
            </span>

        </p>

        ${failedMessage}

        <img 
            class="popUpClose"
            src="assets/buttons/toHomeBtn.png"
            onclick="goBackToLearning()"
        >
    `;

    document.body.appendChild(endPopup);

    /* EMAILJS */

    // emailjs.send(
    //     "service_2ufvwvi",
    //     "template_v99t2wf",
    //     {
    //         to_email: targetEmail,

    //         role: role,

    //         branch: branch,

    //         full_name: userData.fullName,

    //         personal_number: userData.personalNumber,

    //         score: `${correctAnswersCount}/${totalQuestions}`,

    //         percent: `${percent}%`
    //     }
    // )
    // .then(() => {

    //     console.log("email sent");

    // })
    // .catch((error) => {

    //     console.log("email error", error);
    // });
}

/* מעבר חזרה */
function goBackToLearning() {

    window.location.href = "index.html";
}